#include "CsvLoadBase.h"
#include <windows.h> // MessageBox 用

// ---------------------------------------------------------------------------
// コンストラクタ
// ---------------------------------------------------------------------------
CsvLoadBase::CsvLoadBase(const std::string& filePath) : csv(filePath) {
    if (csv.GetLines() < 1) {
        MessageBox(NULL, "CSVファイルが読めません", "エラー", MB_OK);
    }
}

// ---------------------------------------------------------------------------
// デストラクタ
// ---------------------------------------------------------------------------
CsvLoadBase::~CsvLoadBase()
{
}
